def lab61():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                 "Северная Македония": "Скопье", "Сербия": "Белград"}

    for i in sorted(countries_dict):
        print(i + ' : ' + countries_dict[i])

    x = input("Введите страну: ")
    print('Столица: ' + countries_dict[x])



def lab62():
    y = input('Введите ваше слово: ').lower()
    alp = {
        "авеинорст": 1,
        "дклмпу": 2,
        "бгёья": 3,
        "йы": 4,
        "жзхцч": 5,
        "шэю": 8,
        "фщъ": 10
    }
    s = 0
    for i in y:
        for j in alp:
            for k in j:
                if k == i:
                    s += alp[j]

    print(s)

lab62()

